import React from "react";
import CityItem from "./CityItem";

const CityItems = () => {
    const cities = [
        { آذربایجان‌شرقی: "آذربایجان شرقی" },
        { آذربایجان‌غربی: "آذربایجان غربی" },
        { اردبیل: "اردبیل" },
        { اصفهان: "اصفهان" },
        { البرز: "البرز" },
        { ایلام: "ایلام" },
        { بوشهر: "بوشهر" },
        { تهران: "تهران" },
        { چهارمحال‌و‌بختیاری: "چهارمحال وبختیاری" },
        { خراسان‌جنوبی: "خراسان جنوبی" },
        { خراسان‌رضوی: "خراسان رضوی" },
        { خراسان‌شمالی: "خراسان شمالی" },
        { خوزستان: "خوزستان" },
        { زنجان: "زنجان" },
        { سمنان: "سمنان" },
        { آذربایجان‌شرقی: "آذربایجان شرقی" },
        { آذربایجان‌غربی: "آذربایجان غربی" },
        { اردبیل: "اردبیل" },
        { اصفهان: "اصفهان" },
        { البرز: "البرز" },
        { ایلام: "ایلام" },
        { بوشهر: "بوشهر" },
        { تهران: "تهران" },
        { چهارمحال‌و‌بختیاری: "چهارمحال وبختیاری" },
        { خراسان‌جنوبی: "خراسان جنوبی" },
        { خراسان‌رضوی: "خراسان رضوی" },
        { خراسان‌شمالی: "خراسان شمالی" },
        { خوزستان: "خوزستان" },
        { زنجان: "زنجان" },
        { سمنان: "سمنان" },
    ];
    
    return (
        <div className="relative h-full overflow-y-scroll overflow-x-hidden snap-y snap-mandatory z-20 scrollbar-thin scrollbar-track-gray-100/20 scrollbar-thumb-gray-400/20 -mt-5 px-10">
           {cities.map((c,index) =>
            <CityItem text={Object.values(c)[0]} key={index}/>
  )}
        </div>
    );
};

export default CityItems;
